This is a file that describes how to make the matrix that indicates individuals in rows and tissues in columns. It can then be used to generate the appropriate heatmap.

#+BEGIN_SRC sh :results output :exports both

cd individuals
for i in $( ls|grep "expr"); do
b=`basename $i ".expr.txt"`
echo $b
cat $i |head -1 > ./d/$b
done

for i in $(cat list.txt); do b=`basename $i ".expr.txt"`;echo $b; done


#+end_Src

#+RESULTS:
#+begin_example
Adipose_Subcutaneous_Analysis
Adipose_Visceral_Omentum_Analysis
Adrenal_Gland_Analysis
Artery_Aorta_Analysis
Artery_Coronary_Analysis
Artery_Tibial_Analysis
Brain_Anterior_cingulate_cortex_BA24_Analysis
Brain_Caudate_basal_ganglia_Analysis
Brain_Cerebellar_Hemisphere_Analysis
Brain_Cerebellum_Analysis
Brain_Cortex_Analysis
Brain_Frontal_Cortex_BA9_Analysis
Brain_Hippocampus_Analysis
Brain_Hypothalamus_Analysis
Brain_Nucleus_accumbens_basal_ganglia_Analysis
Brain_Putamen_basal_ganglia_Analysis
Breast_Mammary_Tissue_Analysis
Cells_EBV-transformed_lymphocytes_Analysis
Cells_Transformed_fibroblasts_Analysis
Colon_Sigmoid_Analysis
Colon_Transverse_Analysis
#+end_example




#+BEGIN_SRC R :file map.pdf :results graphics :exports results :session
       setwd("./individuals/d")
        file=list.files()
  index=grep("Analysis",list.files())
  files=file[index]
        tissues=read.table("tissuenames.txt",row.names=NULL)
              names <- list()
              for(i in 1:length(files)){
                  names[[i]]=data.frame(read.table(files[i],header=FALSE,sep="\t"))}

      ###To determine length:

         (max.inds <- max(unlist(lapply(names,function(x){ncol(x)}))))
      (tissue.max=tissues$V1[which.max(unlist(lapply(names,function(x){ncol(x)})))])
      namevector=t(data.frame(read.table(files[tissue.max],header=FALSE,sep="\t")))





      mat=matrix(NA,nrow=length(files),ncol=max.inds)

      for(i in 1:44){
          r=data.frame(names[[i]])
          l=ncol(r)

          if(l<=362)
              {
              nulls=362-l
              n=matrix(NA,ncol=nulls,nrow=1)
              r=as.matrix(cbind(r,n))
          }
              mat[i,]=r[1,]
      }


      rownames(mat)=tissues$V1

      ind.rows=t(mat)
      rownames(ind.rows)=namevector[,1]


      matched.mat=matrix(NA,ncol=44,nrow=362)
      for(i in 1:ncol(ind.rows)){
         matched.mat[,i]= ind.rows[match(namevector[,1],ind.rows[,i]),i]
      }

      rownames(matched.mat)=namevector[,1]
      colnames(matched.mat)=tissues$V1

    boolean.mat=matrix(NA,ncol=44,nrow=362)

      matched.mat[1:10,1:10]

    for(i in 1:nrow(matched.mat)){
        row=matched.mat[i,]
    t=sapply(row,function(x){
    if(is.na(x)){x=0}
      else if(!is.na(x)){x=1}
    })
      boolean.mat[i,]=t
    }

      rownames(boolean.mat)=namevector[,1]
      colnames(boolean.mat)=tissues$V1
   boolean.mat=(as.matrix(data.frame(boolean.mat)))


  S=44
  V=362

  myheatmap <- function(z, out.file="") {
    def.par <- par(no.readonly=TRUE)
    par(mar=c(4,5,3,2), font=2, font.axis=2, font.lab=2, cex=1.5, lwd=2)
    if (out.file != "")
      pdf(out.file)
    layout(mat=cbind(1, 2), width=c(7,1))  # plot +  legend
    mycol <- rev(heat.colors(4))

   image(x=1:NCOL(z), y=1:NROW(z), z=t(z),
          xlim=0.5+c(0,NCOL(z)), ylim=0.5+c(0,NROW(z)),
          xlab="Tissues", ylab="Individuals", main="Presence of Tissue Sample",
          axes=FALSE, col=mycol)
    axis(1, 1:NCOL(z), labels=1:ncol(z))
     #text(pl, par("usr")[3], labels =tissues$V1, srt = 45, adj = c(1.1,1.1),xpd=TRUE,cex=.5)
    axis(2)
   #text(seq(1, ncol(z), by=10), labels =paste("tissue",1:ncol(z)), srt = 90, pos = 1,xpd=TRUE)
    #axis(1, 1:NCOL(z), labels=tissues$V1, tick=0)
    par(mar=c(0,0,0,0))
    plot.new()
    legend("center", legend=sprintf("%.2f", seq(from=0, to=1, length.out=2)),
           fill=mycol[c(1,4)], border=mycol[c(1,4)], bty="n")
    if (out.file != "")
      dev.off()
    par(def.par)
   }

  myheatmap(boolean.mat)


#+END_SRC R

#+RESULTS:
[[file:map.pdf]]

Because it is visually unappealing to read all of the tissue names in the x axis, I've included a list of the tissues corresponding to each number.


#+begin_SRC R :results output :exports results :session
(tissues$V1)
#+end_src R

#+RESULTS:
#+begin_example
 [1] Adipose_Subcutaneous_Analysis
 [2] Adipose_Visceral_Omentum_Analysis
 [3] Adrenal_Gland_Analysis
 [4] Artery_Aorta_Analysis
 [5] Artery_Coronary_Analysis
 [6] Artery_Tibial_Analysis
 [7] Brain_Anterior_cingulate_cortex_BA24_Analysis
 [8] Brain_Caudate_basal_ganglia_Analysis
 [9] Brain_Cerebellar_Hemisphere_Analysis
[10] Brain_Cerebellum_Analysis
[11] Brain_Cortex_Analysis
[12] Brain_Frontal_Cortex_BA9_Analysis
[13] Brain_Hippocampus_Analysis
[14] Brain_Hypothalamus_Analysis
[15] Brain_Nucleus_accumbens_basal_ganglia_Analysis
[16] Brain_Putamen_basal_ganglia_Analysis
[17] Breast_Mammary_Tissue_Analysis
[18] Cells_EBV-transformed_lymphocytes_Analysis
[19] Cells_Transformed_fibroblasts_Analysis
[20] Colon_Sigmoid_Analysis
[21] Colon_Transverse_Analysis
[22] Esophagus_Gastroesophageal_Junction_Analysis
[23] Esophagus_Mucosa_Analysis
[24] Esophagus_Muscularis_Analysis
[25] Heart_Atrial_Appendage_Analysis
[26] Heart_Left_Ventricle_Analysis
[27] Liver_Analysis
[28] Lung_Analysis
[29] Muscle_Skeletal_Analysis
[30] Nerve_Tibial_Analysis
[31] Ovary_Analysis
[32] Pancreas_Analysis
[33] Pituitary_Analysis
[34] Prostate_Analysis
[35] Skin_Not_Sun_Exposed_Suprapubic_Analysis
[36] Skin_Sun_Exposed_Lower_leg_Analysis
[37] Small_Intestine_Terminal_Ileum_Analysis
[38] Spleen_Analysis
[39] Stomach_Analysis
[40] Testis_Analysis
[41] Thyroid_Analysis
[42] Uterus_Analysis
[43] Vagina_Analysis
[44] Whole_Blood_Analysis
44 Levels: Adipose_Subcutaneous_Analysis ... Whole_Blood_Analysis
#+end_example










